tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k40_tdd.h
#define SLRD5                         1091
#define SLRD6                         1092
#define SLRD7                         1093
#define ODCOND                        1094
#define ODCD0                         1095
#define ODCD1                         1096
#define ODCD2                         1097
#define ODCD3                         1098
#define ODCD4                         1099
#define ODCD5                         1100
#define ODCD6                         1101
#define ODCD7                         1102
#define WPUD                          1103
#define WPUD0                         1104
#define WPUD1                         1105
#define WPUD2                         1106
#define WPUD3                         1107
#define WPUD4                         1108
#define WPUD5                         1109
#define WPUD6                         1110
#define WPUD7                         1111
#define ANSELD                        1112
#define ANSELD0                       1113
#define ANSELD1                       1114
#define ANSELD2                       1115
#define ANSELD3                       1116
#define ANSELD4                       1117
#define ANSELD5                       1118
#define ANSELD6                       1119
#define ANSELD7                       1120
#define IOCEF                         1121
#define IOCEF3                        1122
#define IOCEN                         1123
#define IOCEN3                        1124
#define IOCEP                         1125
#define IOCEP3                        1126
#define INLVLE                        1127
#define INLVLE0                       1128
#define INLVLE1                       1129
#define INLVLE2                       1130
#define INLVLE3                       1131
#define SLRCONE                       1132
#define SLRE0                         1133
#define SLRE1                         1134
#define SLRE2                         1135
#define ODCONE                        1136
#define ODCE0                         1137
#define ODCE1                         1138
#define ODCE2                         1139
#define WPUE                          1140
#define WPUE0                         1141
#define WPUE1                         1142
#define WPUE2                         1143
#define WPUE3                         1144
#define ANSELE                        1145
#define ANSELE0                       1146
#define ANSELE1                       1147
#define ANSELE2                       1148
#define HLVDCON0                      1149
#define INTL                          1150
#define HLVDINTL                      1151
#define INTH                          1152
#define HLVDINTH                      1153
#define RDY                           1154
#define HLVDRDY                       1155
#define HLVDCON0_OUT                  1156
#define HLVDOUT                       1157
#define HLVDEN                        1158
#define HLVDCON0_EN                   1159
#define HLVDCON1                      1160
#define HLVDSEL0                      1161
#define SEL                           1162
#define SEL0                          1163
#define HLVDSEL1                      1164
#define SEL1                          1165
#define HLVDSEL2                      1166
#define SEL2                          1167
#define HLVDSEL3                      1168
#define SEL3                          1169
#define FVRCON                        1170
#define ADFVR0                        1171
#define ADFVR                         1172
#define ADFVR1                        1173
#define CDAFVR                        1174
#define CDAFVR0                       1175
#define CDAFVR1                       1176
#define TSRNG                         1177
#define TSEN                          1178
#define FVRRDY                        1179
#define FVREN                         1180
#define ZCDCON                        1181
#define ZCDINTN                       1182
#define ZCDINTP                       1183
#define ZCDPOL                        1184
#define ZCDOUT                        1185
#define ZCDSEN                        1186
#define DAC1CON0                      1187
#define NSS                           1188
#define DAC1NSS                       1189
#define DAC1PSS0                      1190
#define PSS                           1191
#define PSS0                          1192
#define PSS1                          1193
#define DAC1PSS1                      1194
#define OE2                           1195
#define DAC1OE2                       1196
#define OE1                           1197
#define DAC1OE1                       1198
#define DAC1CON0_EN                   1199
#define DAC1EN                        1200
#define DAC1CON1                      1201
#define DAC1R                         1202
#define DAC1R0                        1203
#define DAC1R1                        1204
#define DAC1R2                        1205
#define DAC1R3                        1206
#define DAC1R4                        1207
#define CM2CON0                       1208
#define CM2CON0_SYNC                  1209
#define C2SYNC                        1210
#define C2HYS                         1211
#define CM2CON0_HYS                   1212
#define C2POL                         1213
#define CM2CON0_POL                   1214
#define C2OUT                         1215
#define CM2CON0_OUT                   1216
#define CM2CON0_EN                    1217
#define C2EN                          1218
#define CM2CON1                       1219
#define C2INTN                        1220
#define CM2CON1_INTN                  1221
#define CM2CON1_INTP                  1222
#define C2INTP                        1223
#define CM2NCH                        1224
#define C2NCH0                        1225
#define CM2NCH_NCH0                   1226
#define CM2NCH_NCH                    1227
#define C2NCH1                        1228
#define CM2NCH_NCH1                   1229
#define C2NCH2                        1230
#define CM2NCH_NCH2                   1231
#define CM2PCH                        1232
#define CM2PCH_PCH                    1233
#define C2PCH0                        1234
#define CM2PCH_PCH0                   1235
#define C2PCH1                        1236
#define CM2PCH_PCH1                   1237
#define C2PCH2                        1238
#define CM2PCH_PCH2                   1239
#define CM1CON0                       1240
#define CM1CON0_SYNC                  1241
#define C1SYNC                        1242
#define CM1CON0_HYS                   1243
#define C1HYS                         1244
#define CM1CON0_POL                   1245
#define C1POL                         1246
#define C1OUT                         1247
#define CM1CON0_OUT                   1248
#define CM1CON0_EN                    1249
#define C1EN                          1250
#define CM1CON1                       1251
#define C1INTN                        1252
#define CM1CON1_INTN                  1253
#define CM1CON1_INTP                  1254
#define C1INTP                        1255
#define CM1NCH                        1256
#define C1NCH0                        1257
#define CM1NCH_NCH0                   1258
#define CM1NCH_NCH                    1259
#define C1NCH1                        1260
#define CM1NCH_NCH1                   1261
#define C1NCH2                        1262
#define CM1NCH_NCH2                   1263
#define CM1PCH                        1264
#define CM1PCH_PCH0                   1265
#define C1PCH0                        1266
#define CM1PCH_PCH                    1267
#define CM1PCH_PCH1                   1268
#define C1PCH1                        1269
#define CM1PCH_PCH2                   1270
#define C1PCH2                        1271
#define CMOUT                         1272
#define MC1OUT                        1273
#define MC2OUT                        1274
#define CLKRCON                       1275
#define CLKRDIV0                      1276
#define DIV                           1277
#define DIV0                          1278
#define CLKRDIV1                      1279
#define DIV1                          1280
#define DIV2                          1281
#define CLKRDIV2                      1282
#define CLKRCON_DC                    1283
#define CLKRCON_DC0                   1284
#define CLKRDC0                       1285
#define CLKRCON_DC1                   1286
#define CLKRDC1                       1287
#define CLKRCON_EN                    1288
#define CLKREN                        1289
#define CLKRCLK                       1290
#define CLKRCLK0                      1291
#define CLK                           1292
#define CLK0                          1293
#define CLKRCLK1                      1294
#define CLK1                          1295
#define CLKRCLK2                      1296
#define CLK2                          1297
#define CWG1CLKCON                    1298
#define CWG1CLKCON_CS                 1299
#define CWG1CS                        1300
#define CWG1ISM                       1301
#define CWG1ISM0                      1302
#define IS                            1303
#define CWG1ISM1                      1304
#define CWG1ISM2                      1305
#define CWG1ISM3                      1306
#define CWG1DBR0                      1307
#define CWG1DBR                       1308
#define DBR                           1309
#define DBR0                          1310
#define CWG1DBR1                      1311
#define DBR1                          1312
#define CWG1DBR2                      1313
#define DBR2                          1314
#define CWG1DBR3                      1315
#define DBR3                          1316
#define CWG1DBR4                      1317
#define DBR4                          1318
#define CWG1DBR5                      1319
#define DBR5                          1320
#define CWG1DBF                       1321
#define CWG1DBF0                      1322
#define DBF                           1323
#define DBF0                          1324
#define CWG1DBF1                      1325
#define DBF1                          1326
#define CWG1DBF2                      1327
#define DBF2                          1328
#define CWG1DBF3                      1329
#define DBF3                          1330
#define CWG1DBF4                      1331
#define DBF4                          1332
#define DBF5                          1333
#define CWG1DBF5                      1334
#define CWG1CON0                      1335
#define CWG1MODE0                     1336
#define CWG1CON0_MODE                 1337
#define CWG1CON0_MODE0                1338
#define CWG1MODE                      1339
#define CWG1MODE1                     1340
#define CWG1CON0_MODE1                1341
#define CWG1MODE2                     1342
#define CWG1CON0_MODE2                1343
#define LD                            1344
#define CWG1LD                        1345
#define CWG1EN                        1346
#define G1EN                          1347
#define CWG1CON0_EN                   1348
#define CWG1CON1                      1349
#define CWG1POLA                      1350
#define POLA                          1351
#define CWG1POLB                      1352
#define POLB                          1353
#define CWG1POLC                      1354
#define POLC                          1355
#define CWG1POLD                      1356
#define POLD                          1357
#define IN                            1358
#define CWG1IN                        1359
#define CWG1AS0                       1360
#define CWG1LSAC                      1361
#define LSAC                          1362
#define LSAC0                         1363
#define CWG1LSAC0                     1364
#define LSAC1                         1365
#define CWG1LSAC1                     1366
#define LSBD0                         1367
#define CWG1LSBD0                     1368
#define LSBD                          1369
#define CWG1LSBD                      1370
#define LSBD1                         1371
#define CWG1LSBD1                     1372
#define CWG1REN                       1373
#define REN                           1374
#define CWG1SHUTDOWN                  1375
#define SHUTDOWN                      1376
#define CWG1AS1                       1377
#define AS0E                          1378
#define AS1E                          1379
#define AS2E                          1380
#define AS3E                          1381
#define AS4E                          1382
#define AS5E                          1383
#define CWG1STR                       1384
#define CWG1STRA                      1385
#define STRA                          1386
#define STRB                          1387
#define CWG1STRB                      1388
#define CWG1STRC                      1389
#define STRC                          1390
#define CWG1STRD                      1391
#define STRD                          1392
#define OVRA                          1393
#define CWG1OVRA                      1394
#define CWG1OVRB                      1395
#define OVRB                          1396
#define OVRC                          1397
#define CWG1OVRC                      1398
#define OVRD                          1399
#define CWG1OVRD                      1400
#define SCANLADRL                     1401
#define SCANLADRL_LADR                1402
#define SCANLADRL_SCANLADR            1403
#define LADR0                         1404
#define SCANLADR0                     1405
#define SCANLADR1                     1406
#define LADR1                         1407
#define LADR2                         1408
#define SCANLADR2                     1409
#define LADR3                         1410
#define SCANLADR3                     1411
#define LADR4                         1412
#define SCANLADR4                     1413
#define LADR5                         1414
#define SCANLADR5                     1415
#define SCANLADR6                     1416
#define LADR6                         1417
#define LADR7                         1418
#define SCANLADR7                     1419
#define SCANLADRH                     1420
#define LADR8                         1421
#define SCANLADRH_SCANLADR            1422
#define SCANLADR8                     1423
#define SCANLADRH_LADR                1424
#define LADR9                         1425
#define SCANLADR9                     1426
#define LADR10                        1427
#define SCANLADR10                    1428
#define SCANLADR11                    1429
#define LADR11                        1430
#define LADR12                        1431
#define SCANLADR12                    1432
#define LADR13                        1433
#define SCANLADR13                    1434
#define LADR14                        1435
#define SCANLADR14                    1436
#define LADR15                        1437
#define SCANLADR15                    1438
#define SCANLADRU                     1439
#define LADR16                        1440
#define SCANLADR16                    1441
#define SCANLADRU_SCANLADR            1442
#define SCANLADRU_LADR                1443
#define SCANLADR17                    1444
#define LADR17                        1445
#define LADR18                        1446
#define SCANLADR18                    1447
#define LADR19                        1448
#define SCANLADR19                    1449
#define SCANLADR20                    1450
#define LADR20                        1451
#define SCANLADR21                    1452
#define LADR21                        1453
#define SCANHADRL                     1454
#define SCANHADR0                     1455
#define HADR0                         1456
#define SCANHADRL_HADR                1457
#define SCANHADRL_SCANHADR            1458
#define SCANHADR1                     1459
#define HADR1                         1460
#define SCANHADR2                     1461
#define HADR2                         1462
#define SCANHADR3                     1463
#define HADR3                         1464
#define SCANHADR4                     1465
#define HADR4                         1466
#define SCANHADR5                     1467
#define HADR5                         1468
#define SCANHADR6                     1469
#define HADR6                         1470
#define SCANHADR7                     1471
#define HADR7                         1472
#define SCANHADRH                     1473
#define HADR8                         1474
#define SCANHADRH_SCANHADR            1475
#define SCANHADR8                     1476
#define SCANHADRH_HADR                1477
#define HADR9                         1478
#define SCANHADR9                     1479
#define HADR10                        1480
#define SCANHADR10                    1481
#define SCANHADR11                    1482
#define HADR11                        1483
#define HADR12                        1484
#define SCANHADR12                    1485
#define HADR13                        1486
#define SCANHADR13                    1487
#define HADR14                        1488
#define SCANHADR14                    1489
#define HADR15                        1490
#define SCANHADR15                    1491
#define SCANHADRU                     1492
#define SCANHADRU_SCANHADR            1493
#define SCANHADRU_HADR                1494
#define HADR16                        1495
#define SCANHADR16                    1496
#define SCANHADR17                    1497
#define HADR17                        1498
#define HADR18                        1499
#define SCANHADR18                    1500
#define HADR19                        1501
#define SCANHADR19                    1502
#define HADR20                        1503
#define SCANHADR20                    1504
#define SCANHADR21                    1505
#define HADR21                        1506
#define SCANCON0                      1507
#define SCANMODE0                     1508
#define SCANCON0_MODE                 1509
#define SCANCON0_MODE0                1510
#define SCANMODE                      1511
#define SCANMODE1                     1512
#define SCANCON0_MODE1                1513
#define INTM                          1514
#define SCANINTM                      1515
#define DABORT                        1516
#define SCANINVALID                   1517
#define INVALID                       1518
#define SCANCON0_BUSY                 1519
#define SCANBUSY                      1520
#define SCANCON0_GO                   1521
#define SCANGO                        1522
#define SCANCON0_EN                   1523
#define SCANEN                        1524
#define SCANTRIG                      1525
#define TSEL0                         1526
#define TSEL                          1527
#define SCANTSEL0                     1528
#define SCANTSEL                      1529
#define TSEL1                         1530
#define SCANTSEL1                     1531
#define TSEL2                         1532
#define SCANTSEL2                     1533
#define TSEL3                         1534
#define SCANTSEL3                     1535
#define MDCON0                        1536
#define MDBIT                         1537
#define BIT                           1538
#define OPOL                          1539
#define MDOPOL                        1540
#define MDOUT                         1541
#define MDCON0_OUT                    1542
#define MDEN                          1543
#define MDCON0_EN                     1544
#define MDCON1                        1545
#define MDCLSYNC                      1546
#define CLSYNC                        1547
#define MDCLPOL                       1548
#define CLPOL                         1549
#define CHSYNC                        1550
#define MDCHSYNC                      1551
#define MDCHPOL                       1552
#define CHPOL                         1553
#define MDSRC                         1554
#define SRCS0                         1555
#define MDSRCS                        1556
#define SRCS                          1557
#define MDSRCS0                       1558
#define SRCS1                         1559
#define MDSRCS1                       1560
#define SRCS2                         1561
#define MDSRCS2                       1562
#define SRCS3                         1563
#define MDSRCS3                       1564
#define MDCARL                        1565
#define CLS0                          1566
#define MDCLS                         1567
#define MDCLS0                        1568
#define CLS                           1569
#define CLS1                          1570
#define MDCLS1                        1571
#define CLS2                          1572
#define MDCLS2                        1573
#define MDCARH                        1574
#define CHS0                          1575
#define CHS                           1576
#define MDCHS                         1577
#define MDCHS0                        1578
#define CHS1                          1579
#define MDCHS1                        1580
#define CHS2                          1581
#define MDCHS2                        1582
#define ADACT0                        1583
#define ADACT                         1584
#define ADACT1                        1585
#define ADACT2                        1586
#define ADACT3                        1587
#define ADACT4                        1588
#define ADCLK                         1589
#define ADCS0                         1590
#define ADCLK_ADCS                    1591
#define ADCS1                         1592
#define ADCS2                         1593
#define ADCS3                         1594
#define ADCS4                         1595
#define ADCS5                         1596
#define ADREF                         1597
#define ADPREF                        1598
#define ADPREF0                       1599
#define ADPREF1                       1600
#define ADNREF                        1601
#define ADCON1                        1602
#define ADDSEN                        1603
#define NVCFG0                        1604
#define NVCFG1                        1605
#define PVCFG0                        1606
#define CHSN3                         1607
#define PVCFG1                        1608
#define VCFG11                        1609
#define ADGPOL                        1610
#define ADIPEN                        1611
#define ADPPOL                        1612
#define ADCON2                        1613
#define ADMD                          1614
#define ADMD0                         1615
#define ADMD1                         1616
#define ADMD2                         1617
#define ADACLR                        1618
#define ADCRS                         1619
#define ADCRS0                        1620
#define ADCRS1                        1621
#define ADCRS2                        1622
#define ADPSIS                        1623
#define ADCON3                        1624
#define ADTMD                         1625
#define ADTMD0                        1626
#define ADTMD1                        1627
#define ADTMD2                        1628
#define ADSOI                         1629
#define ADCALC                        1630
#define ADCALC0                       1631
#define ADCALC1                       1632
#define ADCALC2                       1633
#define ADACQ                         1634
#define ADACQ0                        1635
#define ADACQ1                        1636
#define ADACQ2                        1637
#define ADACQ3                        1638
#define ADACQ4                        1639
#define ADACQ5                        1640
#define ADACQ6                        1641
#define ADACQ7                        1642
#define ADCAP                         1643
#define ADCAP0                        1644
#define ADCAP1                        1645
#define ADCAP2                        1646
#define ADCAP3                        1647
#define ADCAP4                        1648
