tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k40_tdd.h
#define ADPRE0                        1649
#define ADPRE                         1650
#define ADPRE1                        1651
#define ADPRE2                        1652
#define ADPRE3                        1653
#define ADPRE4                        1654
#define ADPRE5                        1655
#define ADPRE6                        1656
#define ADPRE7                        1657
#define ADPCH                         1658
#define ADPCH0                        1659
#define ADPCH1                        1660
#define ADPCH2                        1661
#define ADPCH3                        1662
#define ADPCH4                        1663
#define ADPCH5                        1664
#define ADCON0                        1665
#define ADCON0_GO                     1666
#define DONE                          1667
#define GO_NOT_DONE                   1668
#define GO_nDONE                      1669
#define ADGO                          1670
#define GODONE                        1671
#define ADFM                          1672
#define ADFM0                         1673
#define ADCON0_ADCS                   1674
#define ADCONT                        1675
#define ADCAL                         1676
#define ADON                          1677
#define ADPREVL                       1678
#define ADPREV0                       1679
#define ADPREV1                       1680
#define ADPREV2                       1681
#define ADPREV3                       1682
#define ADPREV4                       1683
#define ADPREV5                       1684
#define ADPREV6                       1685
#define ADPREV7                       1686
#define ADPREVH                       1687
#define ADPREV8                       1688
#define ADPREV9                       1689
#define ADPREV10                      1690
#define ADPREV11                      1691
#define ADPREV12                      1692
#define ADPREV13                      1693
#define ADPREV14                      1694
#define ADPREV15                      1695
#define ADRESL                        1696
#define ADRES0                        1697
#define ADRES1                        1698
#define ADRES2                        1699
#define ADRES3                        1700
#define ADRES4                        1701
#define ADRES5                        1702
#define ADRES6                        1703
#define ADRES7                        1704
#define ADRESH                        1705
#define ADRES8                        1706
#define ADRES9                        1707
#define ADRES10                       1708
#define ADRES11                       1709
#define ADRES12                       1710
#define ADRES13                       1711
#define ADRES14                       1712
#define ADRES15                       1713
#define ADSTAT                        1714
#define ADSTAT0                       1715
#define ADSTAT1                       1716
#define ADSTAT2                       1717
#define ADMATH                        1718
#define ADLTHR                        1719
#define ADUTHR                        1720
#define ADAOV                         1721
#define ADRPT0                        1722
#define ADRPT                         1723
#define ADRPT1                        1724
#define ADRPT2                        1725
#define ADRPT3                        1726
#define ADRPT4                        1727
#define ADRPT5                        1728
#define ADRPT6                        1729
#define ADRPT7                        1730
#define ADCNT0                        1731
#define ADCNT                         1732
#define ADCNT1                        1733
#define ADCNT2                        1734
#define ADCNT3                        1735
#define ADCNT4                        1736
#define ADCNT5                        1737
#define ADCNT6                        1738
#define ADCNT7                        1739
#define ADSTPT0                       1740
#define ADSTPTL                       1741
#define ADSTPT1                       1742
#define ADSTPT2                       1743
#define ADSTPT3                       1744
#define ADSTPT4                       1745
#define ADSTPT5                       1746
#define ADSTPT6                       1747
#define ADSTPT7                       1748
#define ADSTPT8                       1749
#define ADSTPTH                       1750
#define ADSTPT9                       1751
#define ADSTPT10                      1752
#define ADSTPT11                      1753
#define ADSTPT12                      1754
#define ADSTPT13                      1755
#define ADSTPT14                      1756
#define ADSTPT15                      1757
#define ADLTH0                        1758
#define ADLTHL                        1759
#define ADLTH1                        1760
#define ADLTH2                        1761
#define ADLTH3                        1762
#define ADLTH4                        1763
#define ADLTH5                        1764
#define ADLTH6                        1765
#define ADLTH7                        1766
#define ADLTH8                        1767
#define ADLTHH                        1768
#define ADLTH9                        1769
#define ADLTH10                       1770
#define ADLTH11                       1771
#define ADLTH12                       1772
#define ADLTH13                       1773
#define ADLTH14                       1774
#define ADLTH15                       1775
#define ADUTH0                        1776
#define ADUTHL                        1777
#define ADUTH1                        1778
#define ADUTH2                        1779
#define ADUTH3                        1780
#define ADUTH4                        1781
#define ADUTH5                        1782
#define ADUTH6                        1783
#define ADUTH7                        1784
#define ADUTH8                        1785
#define ADUTHH                        1786
#define ADUTH9                        1787
#define ADUTH10                       1788
#define ADUTH11                       1789
#define ADUTH12                       1790
#define ADUTH13                       1791
#define ADUTH14                       1792
#define ADUTH15                       1793
#define ADERR0                        1794
#define ADERRL                        1795
#define ADERR1                        1796
#define ADERR2                        1797
#define ADERR3                        1798
#define ADERR4                        1799
#define ADERR5                        1800
#define ADERR6                        1801
#define ADERR7                        1802
#define ADERR8                        1803
#define ADERRH                        1804
#define ADERR9                        1805
#define ADERR10                       1806
#define ADERR11                       1807
#define ADERR12                       1808
#define ADERR13                       1809
#define ADERR14                       1810
#define ADERR15                       1811
#define ADACC0                        1812
#define ADACCL                        1813
#define ADACC1                        1814
#define ADACC2                        1815
#define ADACC3                        1816
#define ADACC4                        1817
#define ADACC5                        1818
#define ADACC6                        1819
#define ADACC7                        1820
#define ADACC8                        1821
#define ADACCH                        1822
#define ADACC9                        1823
#define ADACC10                       1824
#define ADACC11                       1825
#define ADACC12                       1826
#define ADACC13                       1827
#define ADACC14                       1828
#define ADACC15                       1829
#define ADFLTR0                       1830
#define ADFLTRL                       1831
#define ADFLTR1                       1832
#define ADFLTR2                       1833
#define ADFLTR3                       1834
#define ADFLTR4                       1835
#define ADFLTR5                       1836
#define ADFLTR6                       1837
#define ADFLTR7                       1838
#define ADFLTR8                       1839
#define ADFLTRH                       1840
#define ADFLTR9                       1841
#define ADFLTR10                      1842
#define ADFLTR11                      1843
#define ADFLTR12                      1844
#define ADFLTR13                      1845
#define ADFLTR14                      1846
#define ADFLTR15                      1847
#define CRCDATL                       1848
#define DATA0                         1849
#define DATA1                         1850
#define DATA2                         1851
#define DATA3                         1852
#define DATA4                         1853
#define DATA5                         1854
#define DATA6                         1855
#define DATA7                         1856
#define CRCDATH                       1857
#define DATA8                         1858
#define DATA9                         1859
#define DATA10                        1860
#define DATA11                        1861
#define DATA12                        1862
#define DATA13                        1863
#define DATA14                        1864
#define DATA15                        1865
#define CRCACCL                       1866
#define ACC0                          1867
#define ACC1                          1868
#define ACC2                          1869
#define ACC3                          1870
#define ACC4                          1871
#define ACC5                          1872
#define ACC6                          1873
#define ACC7                          1874
#define CRCACCH                       1875
#define ACC8                          1876
#define ACC9                          1877
#define ACC10                         1878
#define ACC11                         1879
#define ACC12                         1880
#define ACC13                         1881
#define ACC14                         1882
#define ACC15                         1883
#define CRCSHIFTL                     1884
#define SHFT0                         1885
#define SHFT1                         1886
#define SHFT2                         1887
#define SHFT3                         1888
#define SHFT4                         1889
#define SHFT5                         1890
#define SHFT6                         1891
#define SHFT7                         1892
#define CRCSHIFTH                     1893
#define SHFT8                         1894
#define SHFT9                         1895
#define SHFT10                        1896
#define SHFT11                        1897
#define SHFT12                        1898
#define SHFT13                        1899
#define SHFT14                        1900
#define SHFT15                        1901
#define CRCXORL                       1902
#define X1                            1903
#define X2                            1904
#define X3                            1905
#define X4                            1906
#define X5                            1907
#define X6                            1908
#define X7                            1909
#define CRCXORH                       1910
#define X8                            1911
#define X9                            1912
#define X10                           1913
#define X11                           1914
#define X12                           1915
#define X13                           1916
#define X14                           1917
#define X15                           1918
#define CRCCON0                       1919
#define FULL                          1920
#define SHIFTM                        1921
#define ACCM                          1922
#define CRCCON0_BUSY                  1923
#define CRCGO                         1924
#define CRCCON0_EN                    1925
#define CRCEN                         1926
#define CRCCON1                       1927
#define PLEN0                         1928
#define PLEN                          1929
#define PLEN1                         1930
#define PLEN2                         1931
#define PLEN3                         1932
#define DLEN                          1933
#define DLEN0                         1934
#define DLEN1                         1935
#define DLEN2                         1936
#define DLEN3                         1937
#define NVMADRL                       1938
#define ADR0                          1939
#define ADR                           1940
#define NVMADR0                       1941
#define ADR1                          1942
#define NVMADR1                       1943
#define ADR2                          1944
#define NVMADR2                       1945
#define ADR3                          1946
#define NVMADR3                       1947
#define ADR4                          1948
#define NVMADR4                       1949
#define NVMADR5                       1950
#define ADR5                          1951
#define ADR6                          1952
#define NVMADR6                       1953
#define ADR7                          1954
#define NVMADR7                       1955
#define NVMADRH                       1956
#define ADRH                          1957
#define NVMADR8                       1958
#define ADR8                          1959
#define ADR9                          1960
#define NVMADR9                       1961
#define NVMDAT0                       1962
#define NVMDAT                        1963
#define NVMDAT1                       1964
#define NVMDAT2                       1965
#define NVMDAT3                       1966
#define NVMDAT4                       1967
#define NVMDAT5                       1968
#define NVMDAT6                       1969
#define NVMDAT7                       1970
#define NVMCON1                       1971
#define RD                            1972
#define WR                            1973
#define WREN                          1974
#define WRERR                         1975
#define FREE                          1976
#define NVMREG                        1977
#define NVMREG0                       1978
#define NVMREG1                       1979
#define NVMCON2                       1980
#define LATA                          1981
#define LATA0                         1982
#define LA0                           1983
#define LATA1                         1984
#define LA1                           1985
#define LATA2                         1986
#define LA2                           1987
#define LATA3                         1988
#define LA3                           1989
#define LATA4                         1990
#define LA4                           1991
#define LATA5                         1992
#define LA5                           1993
#define LATA6                         1994
#define LA6                           1995
#define LATA7                         1996
#define LA7                           1997
#define LATB                          1998
#define LB0                           1999
#define LATB0                         2000
#define LB1                           2001
#define LATB1                         2002
#define LB2                           2003
#define LATB2                         2004
#define LB3                           2005
#define LATB3                         2006
#define LB4                           2007
#define LATB4                         2008
#define LB5                           2009
#define LATB5                         2010
#define LB6                           2011
#define LATB6                         2012
#define LB7                           2013
#define LATB7                         2014
#define LATC                          2015
#define LATC0                         2016
#define LC0                           2017
#define LATC1                         2018
#define LC1                           2019
#define LATC2                         2020
#define LC2                           2021
#define LATC3                         2022
#define LC3                           2023
#define LATC4                         2024
#define LC4                           2025
#define LATC5                         2026
#define LC5                           2027
#define LATC6                         2028
#define LC6                           2029
#define LATC7                         2030
#define LC7                           2031
#define LATD                          2032
#define LATD0                         2033
#define LD0                           2034
#define LATD1                         2035
#define LD1                           2036
#define LATD2                         2037
#define LD2                           2038
#define LATD3                         2039
#define LD3                           2040
#define LATD4                         2041
#define LD4                           2042
#define LATD5                         2043
#define LD5                           2044
#define LATD6                         2045
#define LD6                           2046
#define LATD7                         2047
#define LD7                           2048
#define LATE                          2049
#define LATE0                         2050
#define LE0                           2051
#define LATE1                         2052
#define LE1                           2053
#define LATE2                         2054
#define LE2                           2055
#define LE3                           2056
#define LE4                           2057
#define LE5                           2058
#define LE6                           2059
#define LE7                           2060
#define TRISA                         2061
#define TRISA0                        2062
#define TRISA_RA0                     2063
#define TRISA1                        2064
#define TRISA_RA1                     2065
#define TRISA2                        2066
#define TRISA_RA2                     2067
#define TRISA3                        2068
#define TRISA_RA3                     2069
#define TRISA_RA4                     2070
#define TRISA4                        2071
#define TRISA_RA5                     2072
#define TRISA5                        2073
#define TRISA_RA6                     2074
#define TRISA6                        2075
#define TRISA_RA7                     2076
#define TRISA7                        2077
#define TRISB                         2078
#define TRISB_RB0                     2079
#define TRISB0                        2080
#define TRISB_RB1                     2081
#define TRISB1                        2082
#define TRISB_RB2                     2083
#define TRISB2                        2084
#define TRISB_RB3                     2085
#define TRISB3                        2086
#define TRISB_RB4                     2087
#define TRISB4                        2088
#define TRISB_RB5                     2089
#define TRISB5                        2090
#define TRISB_RB6                     2091
#define TRISB6                        2092
#define TRISB_RB7                     2093
#define TRISB7                        2094
#define TRISC                         2095
#define TRISC0                        2096
#define TRISC_RC0                     2097
#define TRISC1                        2098
#define TRISC_RC1                     2099
#define TRISC2                        2100
#define TRISC_RC2                     2101
#define TRISC3                        2102
#define TRISC_RC3                     2103
#define TRISC4                        2104
#define TRISC_RC4                     2105
#define TRISC5                        2106
#define TRISC_RC5                     2107
#define TRISC6                        2108
#define TRISC_RC6                     2109
#define TRISC7                        2110
#define TRISC_RC7                     2111
#define TRISD                         2112
#define TRISD_RD0                     2113
#define TRISD0                        2114
#define TRISD_RD1                     2115
#define TRISD1                        2116
#define TRISD_RD2                     2117
#define TRISD2                        2118
#define TRISD_RD3                     2119
#define TRISD3                        2120
#define TRISD_RD4                     2121
#define TRISD4                        2122
#define TRISD_RD5                     2123
#define TRISD5                        2124
#define TRISD_RD6                     2125
#define TRISD6                        2126
#define TRISD_RD7                     2127
#define TRISD7                        2128
#define TRISE                         2129
#define TRISE_RE0                     2130
#define TRISE0                        2131
#define TRISE_RE1                     2132
#define TRISE1                        2133
#define TRISE_RE2                     2134
#define TRISE2                        2135
#define PORTA                         2136
#define ULPWUIN                       2137
#define PORTA_RA0                     2138
#define PORTA_RA1                     2139
#define PORTA_RA2                     2140
#define PORTA_RA3                     2141
#define PORTA_RA4                     2142
#define LVDIN                         2143
#define PORTA_RA5                     2144
#define PORTA_RA6                     2145
#define PORTA_RA7                     2146
#define RJPU                          2147
#define PORTB                         2148
#define PORTB_RB0                     2149
#define PORTB_RB1                     2150
#define PORTB_RB2                     2151
#define CCP2_PA2                      2152
#define PORTB_RB3                     2153
#define PORTB_RB4                     2154
#define PORTB_RB5                     2155
#define PORTB_RB6                     2156
#define PORTB_RB7                     2157
#define PORTC                         2158
#define PORTC_RC0                     2159
#define PA2                           2160
#define PORTC_RC1                     2161
#define CCP2                          2162
#define PA1                           2163
#define PORTC_RC2                     2164
#define PORTC_RC3                     2165
#define PORTC_RC4                     2166
#define PORTC_RC5                     2167
#define PORTC_RC6                     2168
#define PORTC_RC7                     2169
#define PORTD                         2170
#define PORTD_RD0                     2171
#define PORTD_RD1                     2172
#define PORTD_RD2                     2173
#define PORTD_RD3                     2174
#define PORTD_RD4                     2175
#define PORTD_RD5                     2176
#define PORTD_RD6                     2177
#define PORTD_RD7                     2178
#define SS2                           2179
#define PORTE                         2180
#define PD2                           2181
#define RDE                           2182
#define PORTE_RE0                     2183
#define WRE                           2184
#define PORTE_RE1                     2185
#define PC2                           2186
#define PORTE_CS                      2187
#define CCP10                         2188
#define PB2                           2189
#define PORTE_RE2                     2190
#define CCP9E                         2191
#define RE3                           2192
#define PC3E                          2193
#define RE4                           2194
#define PB3E                          2195
#define CCP8E                         2196
#define CCP7E                         2197
#define RE5                           2198
#define PC1E                          2199
#define CCP6E                         2200
#define RE6                           2201
#define PB1E                          2202
#define CCP2E                         2203
#define PA2E                          2204
#define RE7                           2205
#define SSP1BUF                       2206
