tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k40_tdd.h
#define SSP1BUF_SSPBUF                2207
#define SSP1ADD                       2208
#define SSP1ADD_SSPADD                2209
#define SSP1ADD_MSK0                  2210
#define MSK01                         2211
#define SSP1ADD_MSK1                  2212
#define MSK11                         2213
#define SSP1ADD_MSK2                  2214
#define MSK21                         2215
#define MSK31                         2216
#define SSP1ADD_MSK3                  2217
#define SSP1ADD_MSK4                  2218
#define MSK41                         2219
#define MSK51                         2220
#define SSP1ADD_MSK5                  2221
#define SSP1ADD_MSK6                  2222
#define MSK61                         2223
#define MSK71                         2224
#define SSP1ADD_MSK7                  2225
#define SSP1MSK                       2226
#define SSP1MSK_MSK0                  2227
#define SSP1MSK_SSPMSK                2228
#define SSP1MSK_MSK1                  2229
#define SSP1MSK_MSK2                  2230
#define SSP1MSK_MSK3                  2231
#define SSP1MSK_MSK4                  2232
#define SSP1MSK_MSK5                  2233
#define SSP1MSK_MSK6                  2234
#define SSP1MSK_MSK7                  2235
#define SSP1STAT                      2236
#define BF1                           2237
#define SSP1STAT_BF                   2238
#define UA1                           2239
#define SSP1STAT_UA                   2240
#define SSP1STAT_R_NOT_W              2241
#define RW1                           2242
#define SSP1STAT_nW                   2243
#define RW                            2244
#define SSP1STAT_READ_WRITE           2245
#define SSP1STAT_nWRITE               2246
#define SSP1STAT_I2C_READ             2247
#define SSP1STAT_R_W                  2248
#define R                             2249
#define SSP1STAT_NOT_WRITE            2250
#define SSP1STAT_R_nW                 2251
#define SSP1STAT_S                    2252
#define START                         2253
#define START1                        2254
#define SSP1STAT_I2C_START            2255
#define STOP                          2256
#define SSP1STAT_P                    2257
#define STOP1                         2258
#define SSP1STAT_I2C_STOP             2259
#define SSP1STAT_D_NOT_A              2260
#define SSP1STAT_D_A                  2261
#define SSP1STAT_D_nA                 2262
#define SSP1STAT_NOT_ADDRESS          2263
#define SSP1STAT_DATA_ADDRESS         2264
#define SSP1STAT_nA                   2265
#define D                             2266
#define DA1                           2267
#define DA                            2268
#define SSP1STAT_nADDRESS             2269
#define SSP1STAT_I2C_DAT              2270
#define SSP1STAT_CKE                  2271
#define CKE1                          2272
#define SSP1STAT_SMP                  2273
#define SMP1                          2274
#define SSP1CON1                      2275
#define SSP1CON1_SSPM0                2276
#define SSPM01                        2277
#define SSP1CON1_SSPM                 2278
#define SSP1CON1_SSPM1                2279
#define SSPM11                        2280
#define SSP1CON1_SSPM2                2281
#define SSPM21                        2282
#define SSPM31                        2283
#define SSP1CON1_SSPM3                2284
#define SSP1CON1_CKP                  2285
#define CKP1                          2286
#define SSPEN1                        2287
#define SSP1CON1_SSPEN                2288
#define SSPOV1                        2289
#define SSP1CON1_SSPOV                2290
#define WCOL1                         2291
#define SSP1CON1_WCOL                 2292
#define SSP1CON2                      2293
#define SEN1                          2294
#define SSP1CON2_SEN                  2295
#define ADMSK11                       2296
#define SSP1CON2_RSEN                 2297
#define RSEN1                         2298
#define SSP1CON2_ADMSK1               2299
#define SSP1CON2_ADMSK                2300
#define SSP1CON2_PEN                  2301
#define ADMSK21                       2302
#define PEN1                          2303
#define SSP1CON2_ADMSK2               2304
#define ADMSK31                       2305
#define RCEN1                         2306
#define SSP1CON2_RCEN                 2307
#define SSP1CON2_ADMSK3               2308
#define SSP1CON2_ACKEN                2309
#define ACKEN1                        2310
#define ADMSK41                       2311
#define SSP1CON2_ADMSK4               2312
#define ACKDT1                        2313
#define ADMSK51                       2314
#define SSP1CON2_ACKDT                2315
#define SSP1CON2_ADMSK5               2316
#define SSP1CON2_ACKSTAT              2317
#define ACKSTAT1                      2318
#define GCEN1                         2319
#define SSP1CON2_GCEN                 2320
#define SSP1CON3                      2321
#define SSP1CON3_DHEN                 2322
#define SSP1CON3_AHEN                 2323
#define SSP1CON3_SBCDE                2324
#define SSP1CON3_SDAHT                2325
#define SSP1CON3_BOEN                 2326
#define SSP1CON3_SCIE                 2327
#define SSP1CON3_PCIE                 2328
#define SSP1CON3_ACKTIM               2329
#define RC1REG                        2330
#define TX1REG                        2331
#define SP1BRGL                       2332
#define SP1BRGH                       2333
#define RC1STA                        2334
#define RC1STA_RX9D                   2335
#define RCD8                          2336
#define RC1STA_OERR                   2337
#define RC1STA_FERR                   2338
#define RC1STA_ADDEN                  2339
#define RC1STA_CREN                   2340
#define RC1STA_SREN                   2341
#define RC1STA_RX9                    2342
#define RC8_9                         2343
#define RC9                           2344
#define RC1STA_SPEN                   2345
#define TX1STA                        2346
#define TXD8                          2347
#define TX1STA_TX9D                   2348
#define TX1STA_TRMT                   2349
#define TX1STA_BRGH                   2350
#define TX1STA_SENDB                  2351
#define TX1STA_SYNC                   2352
#define TX1STA_TXEN                   2353
#define TX1STA_TX9                    2354
#define TX8_9                         2355
#define TX1STA_CSRC                   2356
#define BAUD1CON                      2357
#define ABDEN1                        2358
#define BAUD1CON_ABDEN                2359
#define WUE1                          2360
#define BAUD1CON_WUE                  2361
#define BRG161                        2362
#define BAUD1CON_BRG16                2363
#define SCKP1                         2364
#define CKTXP                         2365
#define TXCKP                         2366
#define BAUD1CON_SCKP                 2367
#define TXCKP1                        2368
#define BAUD1CON_RCIDL                2369
#define RCMT1                         2370
#define RCIDL1                        2371
#define RCMT                          2372
#define BAUD1CON_ABDOVF               2373
#define ABDOVF1                       2374
#define PWM4DCL                       2375
#define PWM4DCL_PWMPW0                2376
#define PWM4DCL_DC                    2377
#define PWM4DC0                       2378
#define PWM4DCL_DC0                   2379
#define PWM4DCL_PWMPW1                2380
#define PWM4DC1                       2381
#define PWM4DCL_DC1                   2382
#define PWM4DCH                       2383
#define PWM4DCH_PWMPW2                2384
#define PWM4DCH_DC                    2385
#define PWM4DC2                       2386
#define PWM4DCH_DC2                   2387
#define PWM4DCH_PWMPW3                2388
#define PWM4DC3                       2389
#define PWM4DCH_DC3                   2390
#define PWM4DCH_PWMPW4                2391
#define PWM4DC4                       2392
#define PWM4DCH_DC4                   2393
#define PWM4DCH_PWMPW5                2394
#define PWM4DC5                       2395
#define PWM4DCH_DC5                   2396
#define PWM4DCH_PWMPW6                2397
#define PWM4DC6                       2398
#define PWM4DCH_DC6                   2399
#define PWM4DCH_PWMPW7                2400
#define PWM4DC7                       2401
#define PWM4DCH_DC7                   2402
#define PWM4DCH_PWMPW8                2403
#define PWM4DC8                       2404
#define PWM4DCH_DC8                   2405
#define PWM4DCH_PWMPW9                2406
#define PWM4DC9                       2407
#define PWM4DCH_DC9                   2408
#define PWM4CON                       2409
#define PWM4POL                       2410
#define PWM4CON_POL                   2411
#define PWM4CON_OUT                   2412
#define PWM4OUT                       2413
#define PWM4EN                        2414
#define PWM4CON_EN                    2415
#define PWM3DCL                       2416
#define PWM3DC0                       2417
#define PWM3DCL_PWMPW0                2418
#define PWM3DCL_DC0                   2419
#define PWM3DCL_DC                    2420
#define PWM3DC1                       2421
#define PWM3DCL_PWMPW1                2422
#define PWM3DCL_DC1                   2423
#define PWM3DCH                       2424
#define PWM3DC2                       2425
#define PWM3DCH_DC2                   2426
#define PWM3DCH_DC                    2427
#define PWM3DCH_PWMPW2                2428
#define PWM3DC3                       2429
#define PWM3DCH_DC3                   2430
#define PWM3DCH_PWMPW3                2431
#define PWM3DC4                       2432
#define PWM3DCH_DC4                   2433
#define PWM3DCH_PWMPW4                2434
#define PWM3DC5                       2435
#define PWM3DCH_DC5                   2436
#define PWM3DCH_PWMPW5                2437
#define PWM3DC6                       2438
#define PWM3DCH_DC6                   2439
#define PWM3DCH_PWMPW6                2440
#define PWM3DC7                       2441
#define PWM3DCH_DC7                   2442
#define PWM3DCH_PWMPW7                2443
#define PWM3DC8                       2444
#define PWM3DCH_DC8                   2445
#define PWM3DCH_PWMPW8                2446
#define PWM3DC9                       2447
#define PWM3DCH_DC9                   2448
#define PWM3DCH_PWMPW9                2449
#define PWM3CON                       2450
#define PWM3CON_POL                   2451
#define PWM3POL                       2452
#define PWM3CON_OUT                   2453
#define PWM3OUT                       2454
#define PWM3EN                        2455
#define PWM3CON_EN                    2456
#define CCPR2L                        2457
#define CCPR2L_RL                     2458
#define CCPR2H                        2459
#define CCPR2H_RH                     2460
#define CCP2CON                       2461
#define CCP2MODE                      2462
#define CCP2MODE0                     2463
#define CCP2CON_MODE0                 2464
#define CCP2CON_MODE                  2465
#define CCP2MODE1                     2466
#define CCP2CON_MODE1                 2467
#define CCP2MODE2                     2468
#define CCP2CON_MODE2                 2469
#define CCP2MODE3                     2470
#define CCP2CON_MODE3                 2471
#define CCP2FMT                       2472
#define CCP2CON_FMT                   2473
#define CCP2OUT                       2474
#define CCP2CON_OUT                   2475
#define CCP2EN                        2476
#define CCP2CON_EN                    2477
#define CCP2CAP                       2478
#define CCP2CAP_CTS                   2479
#define CCP2CAP_CTS0                  2480
#define CCP2CTS                       2481
#define CCP2CTS0                      2482
#define CCP2CAP_CTS1                  2483
#define CCP2CTS1                      2484
#define CCPR1L                        2485
#define CCPR1L_RL                     2486
#define CCPR1H                        2487
#define CCPR1H_RH                     2488
#define CCP1CON                       2489
#define CCP1MODE0                     2490
#define CCP1CON_MODE0                 2491
#define CCP1CON_MODE                  2492
#define CCP1MODE                      2493
#define CCP1MODE1                     2494
#define CCP1CON_MODE1                 2495
#define CCP1MODE2                     2496
#define CCP1CON_MODE2                 2497
#define CCP1MODE3                     2498
#define CCP1CON_MODE3                 2499
#define CCP1FMT                       2500
#define CCP1CON_FMT                   2501
#define CCP1CON_OUT                   2502
#define CCP1OUT                       2503
#define CCP1EN                        2504
#define CCP1CON_EN                    2505
#define P1M1                          2506
#define CCP1CAP                       2507
#define CCP1CTS0                      2508
#define CCP1CAP_CTS                   2509
#define CCP1CAP_CTS0                  2510
#define CCP1CTS                       2511
#define CCP1CTS1                      2512
#define CCP1CAP_CTS1                  2513
#define CCPTMRS                       2514
#define C1TSEL0                       2515
#define C1TSEL                        2516
#define C1TSEL1                       2517
#define C2TSEL0                       2518
#define C2TSEL                        2519
#define C2TSEL1                       2520
#define P3TSEL                        2521
#define P3TSEL0                       2522
#define P3TSEL1                       2523
#define P4TSEL0                       2524
#define P4TSEL                        2525
#define P4TSEL1                       2526
#define T6TMR                         2527
#define TMR6                          2528
#define T6PR                          2529
#define PR6                           2530
#define T6CON                         2531
#define T6CON_OUTPS0                  2532
#define T6OUTPS                       2533
#define T6CON_OUTPS                   2534
#define T6OUTPS0                      2535
#define T6CON_OUTPS1                  2536
#define T6OUTPS1                      2537
#define T6CON_OUTPS2                  2538
#define T6OUTPS2                      2539
#define T6CON_OUTPS3                  2540
#define T6OUTPS3                      2541
#define T6CON_CKPS0                   2542
#define T6CKPS                        2543
#define T6CKPS0                       2544
#define T6CON_CKPS                    2545
#define T6CON_CKPS1                   2546
#define T6CKPS1                       2547
#define T6CON_CKPS2                   2548
#define T6CKPS2                       2549
#define TMR6ON                        2550
#define T6ON                          2551
#define T6CON_ON                      2552
#define T6HLT                         2553
#define T6HLT_MODE0                   2554
#define T6HLT_MODE                    2555
#define T6MODE0                       2556
#define T6MODE                        2557
#define T6HLT_MODE1                   2558
#define T6MODE1                       2559
#define T6MODE2                       2560
#define T6HLT_MODE2                   2561
#define T6HLT_MODE3                   2562
#define T6MODE3                       2563
#define T6MODE4                       2564
#define T6HLT_MODE4                   2565
#define T6CKSYNC                      2566
#define T6HLT_CKSYNC                  2567
#define T6CKPOL                       2568
#define T6HLT_CKPOL                   2569
#define T6PSYNC                       2570
#define T6HLT_PSYNC                   2571
#define T6CLKCON                      2572
#define T6CS                          2573
#define T6CS0                         2574
#define T6CS1                         2575
#define T6CS2                         2576
#define T6CS3                         2577
#define T6RST                         2578
#define T6RST_RSEL                    2579
#define T6RST_RSEL0                   2580
#define T6RSEL                        2581
#define T6RSEL0                       2582
#define T6RST_RSEL1                   2583
#define T6RSEL1                       2584
#define T6RSEL2                       2585
#define T6RST_RSEL2                   2586
#define T6RST_RSEL3                   2587
#define T6RSEL3                       2588
#define T4TMR                         2589
#define TMR4                          2590
#define T4PR                          2591
#define PR4                           2592
#define T4CON                         2593
#define T4OUTPS0                      2594
#define T4CON_OUTPS                   2595
#define T4OUTPS                       2596
#define T4CON_OUTPS0                  2597
#define T4OUTPS1                      2598
#define T4CON_OUTPS1                  2599
#define T4CON_OUTPS2                  2600
#define T4OUTPS2                      2601
#define T4OUTPS3                      2602
#define T4CON_OUTPS3                  2603
#define T4CON_CKPS0                   2604
#define T4CKPS0                       2605
#define T4CON_CKPS                    2606
#define T4CKPS                        2607
#define T4CKPS1                       2608
#define T4CON_CKPS1                   2609
#define T4CKPS2                       2610
#define T4CON_CKPS2                   2611
#define T4ON                          2612
#define T4CON_ON                      2613
#define TMR4ON                        2614
#define T4HLT                         2615
#define T4MODE                        2616
#define T4HLT_MODE                    2617
#define T4HLT_MODE0                   2618
#define T4MODE0                       2619
#define T4HLT_MODE1                   2620
#define T4MODE1                       2621
#define T4HLT_MODE2                   2622
#define T4MODE2                       2623
#define T4HLT_MODE3                   2624
#define T4MODE3                       2625
#define T4HLT_MODE4                   2626
#define T4MODE4                       2627
#define T4HLT_CKSYNC                  2628
#define T4CKSYNC                      2629
#define T4HLT_CKPOL                   2630
#define T4CKPOL                       2631
#define T4PSYNC                       2632
#define T4HLT_PSYNC                   2633
#define T4CLKCON                      2634
#define T4CS0                         2635
#define T4CS                          2636
#define T4CS1                         2637
#define T4CS2                         2638
#define T4CS3                         2639
#define T4RST                         2640
#define T4RSEL0                       2641
#define T4RSEL                        2642
#define T4RST_RSEL                    2643
#define T4RST_RSEL0                   2644
#define T4RSEL1                       2645
#define T4RST_RSEL1                   2646
#define T4RSEL2                       2647
#define T4RST_RSEL2                   2648
#define T4RSEL3                       2649
#define T4RST_RSEL3                   2650
#define T2TMR                         2651
#define TMR2                          2652
#define T2PR                          2653
#define PR2                           2654
#define T2CON                         2655
#define T2OUTPS0                      2656
#define T2CON_OUTPS0                  2657
#define T2OUTPS                       2658
#define T2CON_OUTPS                   2659
#define T2OUTPS1                      2660
#define T2CON_OUTPS1                  2661
#define T2OUTPS2                      2662
#define T2CON_OUTPS2                  2663
#define T2OUTPS3                      2664
#define T2CON_OUTPS3                  2665
#define T2CKPS0                       2666
#define T2CON_CKPS                    2667
#define T2CKPS                        2668
#define T2CON_CKPS0                   2669
#define T2CKPS1                       2670
#define T2CON_CKPS1                   2671
#define T2CKPS2                       2672
#define T2CON_CKPS2                   2673
#define T2CON_ON                      2674
#define TMR2ON                        2675
#define T2ON                          2676
#define T2HLT                         2677
#define T2HLT_MODE                    2678
#define T2MODE                        2679
#define T2MODE0                       2680
#define T2HLT_MODE0                   2681
#define T2MODE1                       2682
#define T2HLT_MODE1                   2683
#define T2MODE2                       2684
#define T2HLT_MODE2                   2685
#define T2MODE3                       2686
#define T2HLT_MODE3                   2687
#define T2MODE4                       2688
#define T2HLT_MODE4                   2689
#define T2HLT_CKSYNC                  2690
#define T2CKSYNC                      2691
#define T2HLT_CKPOL                   2692
#define T2CKPOL                       2693
#define T2PSYNC                       2694
#define T2HLT_PSYNC                   2695
#define T2CLKCON                      2696
#define T2CS                          2697
#define T2CS0                         2698
#define T2CS1                         2699
#define T2CS2                         2700
#define T2CS3                         2701
#define T2RST                         2702
#define T2RSEL0                       2703
#define T2RST_RSEL                    2704
#define T2RSEL                        2705
#define T2RST_RSEL0                   2706
#define T2RSEL1                       2707
#define T2RST_RSEL1                   2708
#define T2RST_RSEL2                   2709
#define T2RSEL2                       2710
#define T2RSEL3                       2711
#define T2RST_RSEL3                   2712
#define TMR5L                         2713
#define TMR5L0                        2714
#define TMR5L1                        2715
#define TMR5L2                        2716
#define TMR5L3                        2717
#define TMR5L4                        2718
#define TMR5L5                        2719
#define TMR5L6                        2720
#define TMR5L7                        2721
#define TMR5H0                        2722
#define TMR5H                         2723
#define TMR5H1                        2724
#define TMR5H2                        2725
#define TMR5H3                        2726
#define TMR5H4                        2727
#define TMR5H5                        2728
#define TMR5H6                        2729
#define TMR5H7                        2730
#define T5CON                         2731
#define T5CON_ON                      2732
#define TMR5ON                        2733
#define T5CON_RD16                    2734
#define T5RD16                        2735
#define RD165                         2736
#define nT5SYNC                       2737
#define T5CON_nSYNC                   2738
#define T5CON_NOT_SYNC                2739
#define NOT_T5SYNC                    2740
#define T5CON_CKPS0                   2741
#define T5CON_CKPS                    2742
#define T5CKPS0                       2743
#define T5CON_CKPS1                   2744
#define T5CKPS1                       2745
#define T5GCON                        2746
#define T5GCON_GVAL                   2747
#define T5GVAL                        2748
#define T5GGO_nDONE                   2749
#define T5GCON_GGO_NOT_DONE           2750
#define T5GCON_GGO_nDONE              2751
#define T5GGO_NOT_DONE                2752
#define T5GGO                         2753
#define T5GCON_GSPM                   2754
#define T5GSPM                        2755
#define T5GTM                         2756
#define T5GCON_GTM                    2757
#define T5GPOL                        2758
#define T5GCON_GPOL                   2759
#define T5GCON_GE                     2760
#define T5GE                          2761
#define T5GATE                        2762
#define T5GATE_GSS0                   2763
#define T5GSS0                        2764
